## Production
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 4 to add, 8 to change, 4 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                        RESOURCE                         |
|----------|---------------------------------------------------------|
| update   | `aws_iam_policy.data_export`                            |
|          | `aws_iam_policy.glue_etl`                               |
|          | `aws_iam_policy.glue_s3_crawler`                        |
|          | `aws_kms_key.data_export`                               |
|          | `aws_s3_bucket_policy.notify_data_export`               |
|          | `module.celery_beat_ecs.aws_ecs_service.this`           |
|          | `module.celery_worker_ecs.aws_ecs_service.this`         |
|          | `module.superset_ecs.aws_ecs_service.this`              |
| recreate | `aws_ecs_task_definition.superset_upgrade`              |
|          | `module.celery_beat_ecs.aws_ecs_task_definition.this`   |
|          | `module.celery_worker_ecs.aws_ecs_task_definition.this` |
|          | `module.superset_ecs.aws_ecs_task_definition.this`      |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.data_export will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "data_export" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "sts:AssumeRole",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:iam::239043911459:role/DataExportSupersetReadSnaphots",
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject*",
              + "s3:GetBucketLocation",
              + "s3:GetObject*",
              + "s3:ListBucket",
              + "s3:PutObject*",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:s3:::cds-superset-notify-data-export",
              + "arn:aws:s3:::cds-superset-notify-data-export/*",
            ]
        }
      + statement {
          + actions   = [
              + "kms:CreateGrant",
              + "kms:Decrypt",
              + "kms:DescribeKey",
              + "kms:Encrypt",
              + "kms:GenerateDataKey",
              + "kms:GenerateDataKeyWithoutPlaintext",
              + "kms:ReEncryptFrom",
              + "kms:ReEncryptTo",
              + "kms:RetireGrant",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:kms:ca-central-1:066023111852:key/08930ec2-593c-44d4-ad5b-7074b1b77e1d",
            ]
        }
    }

  # data.aws_iam_policy_document.glue_etl will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "glue_etl" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
              + "s3:PutObject",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:s3:::4d9f3f22-cff9-4407-ab55-a0d2373b382e/*",
              + "arn:aws:s3:::5bf89a78-1503-4e02-9621-3ac658f558fb/*",
              + "arn:aws:s3:::713f18dd-9f30-4976-a152-e81d48cf053a/*",
              + "arn:aws:s3:::713f18dd-9f30-4976-a152-e81d48cf053a/cds_/DailyCostExports/*",
              + "arn:aws:s3:::cds-superset-notify-data-export/*",
            ]
        }
      + statement {
          + actions   = [
              + "athena:*",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "kms:CreateGrant",
              + "kms:Decrypt",
              + "kms:DescribeKey",
              + "kms:Encrypt",
              + "kms:GenerateDataKey",
              + "kms:GenerateDataKeyWithoutPlaintext",
              + "kms:ReEncryptFrom",
              + "kms:ReEncryptTo",
              + "kms:RetireGrant",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:kms:ca-central-1:066023111852:key/08930ec2-593c-44d4-ad5b-7074b1b77e1d",
            ]
        }
    }

  # data.aws_iam_policy_document.glue_s3_crawler will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "glue_s3_crawler" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::713f18dd-9f30-4976-a152-e81d48cf053a/cds_/DailyCostExports/*",
              + "arn:aws:s3:::cds-superset-notify-data-export/*",
            ]
        }
      + statement {
          + actions   = [
              + "kms:CreateGrant",
              + "kms:Decrypt",
              + "kms:DescribeKey",
              + "kms:Encrypt",
              + "kms:GenerateDataKey",
              + "kms:GenerateDataKeyWithoutPlaintext",
              + "kms:ReEncryptFrom",
              + "kms:ReEncryptTo",
              + "kms:RetireGrant",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:kms:ca-central-1:066023111852:key/08930ec2-593c-44d4-ad5b-7074b1b77e1d",
            ]
        }
    }

  # aws_ecs_task_definition.superset_upgrade must be replaced
-/+ resource "aws_ecs_task_definition" "superset_upgrade" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:066023111852:task-definition/superset-upgrade:2" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ca-central-1:066023111852:task-definition/superset-upgrade" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ linuxParameters  = {
                      ~ capabilities = {
                          - add  = []
                            # (1 unchanged attribute hidden)
                        }
                    }
                  - mountPoints      = []
                    name             = "superset-upgrade"
                  - systemControls   = []
                  - volumesFrom      = []
                    # (9 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "superset-upgrade" -> (known after apply)
      ~ revision                 = 2 -> (known after apply)
        tags                     = {
            "CostCentre" = "cds-superset-prod"
            "Terraform"  = "true"
        }
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_iam_policy.data_export will be updated in-place
  ~ resource "aws_iam_policy" "data_export" {
        id          = "arn:aws:iam::066023111852:policy/service-role/DataExportSupersetReadSnaphots"
        name        = "DataExportSupersetReadSnaphots"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "sts:AssumeRole"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:iam::296255494825:role/DataExportSupersetReadSnaphots",
                          - "arn:aws:iam::239043911459:role/DataExportSupersetReadSnaphots",
                        ]
                    },
                  - {
                      - Action   = [
                          - "s3:PutObject*",
                          - "s3:ListBucket",
                          - "s3:GetObject*",
                          - "s3:GetBucketLocation",
                          - "s3:DeleteObject*",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::cds-superset-notify-data-export/*",
                          - "arn:aws:s3:::cds-superset-notify-data-export",
                        ]
                    },
                  - {
                      - Action   = [
                          - "kms:RetireGrant",
                          - "kms:ReEncryptTo",
                          - "kms:ReEncryptFrom",
                          - "kms:GenerateDataKeyWithoutPlaintext",
                          - "kms:GenerateDataKey",
                          - "kms:Encrypt",
                          - "kms:DescribeKey",
                          - "kms:Decrypt",
                          - "kms:CreateGrant",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:kms:ca-central-1:066023111852:key/08930ec2-593c-44d4-ad5b-7074b1b77e1d"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags        = {}
        # (5 unchanged attributes hidden)
    }

  # aws_iam_policy.glue_etl will be updated in-place
  ~ resource "aws_iam_policy" "glue_etl" {
        id          = "arn:aws:iam::066023111852:policy/service-role/AWSGlueServiceRole-etl"
        name        = "AWSGlueServiceRole-etl"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:GetObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::cds-superset-notify-data-export/*",
                          - "arn:aws:s3:::713f18dd-9f30-4976-a152-e81d48cf053a/cds_/DailyCostExports/*",
                          - "arn:aws:s3:::713f18dd-9f30-4976-a152-e81d48cf053a/*",
                          - "arn:aws:s3:::5bf89a78-1503-4e02-9621-3ac658f558fb/*",
                          - "arn:aws:s3:::4d9f3f22-cff9-4407-ab55-a0d2373b382e/*",
                        ]
                    },
                  - {
                      - Action   = "athena:*"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "kms:RetireGrant",
                          - "kms:ReEncryptTo",
                          - "kms:ReEncryptFrom",
                          - "kms:GenerateDataKeyWithoutPlaintext",
                          - "kms:GenerateDataKey",
                          - "kms:Encrypt",
                          - "kms:DescribeKey",
                          - "kms:Decrypt",
                          - "kms:CreateGrant",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:kms:ca-central-1:066023111852:key/08930ec2-593c-44d4-ad5b-7074b1b77e1d"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags        = {}
        # (5 unchanged attributes hidden)
    }

  # aws_iam_policy.glue_s3_crawler will be updated in-place
  ~ resource "aws_iam_policy" "glue_s3_crawler" {
        id          = "arn:aws:iam::066023111852:policy/service-role/AWSGlueServiceRole-cds_cur_extract_crawler-EZCRC-s3Policy"
        name        = "AWSGlueServiceRole-cds_cur_extract_crawler-EZCRC-s3Policy"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:GetObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::cds-superset-notify-data-export/*",
                          - "arn:aws:s3:::713f18dd-9f30-4976-a152-e81d48cf053a/cds_/DailyCostExports/*",
                        ]
                    },
                  - {
                      - Action   = [
                          - "kms:RetireGrant",
                          - "kms:ReEncryptTo",
                          - "kms:ReEncryptFrom",
                          - "kms:GenerateDataKeyWithoutPlaintext",
                          - "kms:GenerateDataKey",
                          - "kms:Encrypt",
                          - "kms:DescribeKey",
                          - "kms:Decrypt",
                          - "kms:CreateGrant",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:kms:ca-central-1:066023111852:key/08930ec2-593c-44d4-ad5b-7074b1b77e1d"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags        = {}
        # (5 unchanged attributes hidden)
    }

  # aws_kms_key.data_export will be updated in-place
  ~ resource "aws_kms_key" "data_export" {
        id                                 = "08930ec2-593c-44d4-ad5b-7074b1b77e1d"
      ~ policy                             = jsonencode(
          ~ {
              ~ Statement = [
                    {
                        Action    = "kms:*"
                        Effect    = "Allow"
                        Principal = {
                            AWS = "066023111852"
                        }
                        Resource  = "*"
                    },
                  ~ {
                      ~ Principal = {
                          ~ AWS = [
                              - "arn:aws:iam::296255494825:role/DataExportSupersetReadSnaphots",
                                "arn:aws:iam::239043911459:role/DataExportSupersetReadSnaphots",
                                # (3 unchanged elements hidden)
                            ]
                        }
                        # (3 unchanged attributes hidden)
                    },
                    {
                        Action    = [
                            "kms:GenerateDataKey*",
                            "kms:Decrypt",
                        ]
                        Effect    = "Allow"
                        Principal = {
                            Service = "s3.amazonaws.com"
                        }
                        Resource  = "*"
                        Sid       = "AllowS3Access"
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags                               = {}
        # (10 unchanged attributes hidden)
    }

  # aws_s3_bucket_policy.notify_data_export will be updated in-place
  ~ resource "aws_s3_bucket_policy" "notify_data_export" {
        id     = "cds-superset-notify-data-export"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Principal = {
                          ~ AWS = [
                              - "arn:aws:iam::296255494825:role/DataExportSupersetReadSnaphots",
                                "arn:aws:iam::239043911459:role/DataExportSupersetReadSnaphots",
                                # (3 unchanged elements hidden)
                            ]
                        }
                        # (3 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

  # module.celery_beat_ecs.aws_ecs_service.this will be updated in-place
  ~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:ca-central-1:066023111852:service/superset/celery-beat"
        name                               = "celery-beat"
        tags                               = {
            "CostCentre" = "cds-superset-prod"
            "Terraform"  = "true"
        }
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:066023111852:task-definition/celery-beat:12" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.celery_beat_ecs.aws_ecs_task_definition.this must be replaced
-/+ resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:066023111852:task-definition/celery-beat:12" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ca-central-1:066023111852:task-definition/celery-beat" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  - cpu                    = 0
                  - essential              = true
                  ~ linuxParameters        = {
                      ~ capabilities = {
                          - add  = []
                            # (1 unchanged attribute hidden)
                        }
                    }
                  - mountPoints            = []
                    name                   = "celery-beat"
                  - systemControls         = []
                  - volumesFrom            = []
                    # (7 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "celery-beat" -> (known after apply)
      ~ revision                 = 12 -> (known after apply)
        tags                     = {
            "CostCentre" = "cds-superset-prod"
            "Terraform"  = "true"
        }
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.celery_worker_ecs.aws_ecs_service.this will be updated in-place
  ~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:ca-central-1:066023111852:service/superset/celery-worker"
        name                               = "celery-worker"
        tags                               = {
            "CostCentre" = "cds-superset-prod"
            "Terraform"  = "true"
        }
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:066023111852:task-definition/celery-worker:13" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.celery_worker_ecs.aws_ecs_task_definition.this must be replaced
-/+ resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:066023111852:task-definition/celery-worker:13" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ca-central-1:066023111852:task-definition/celery-worker" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  - cpu                    = 0
                  - essential              = true
                  ~ linuxParameters        = {
                      ~ capabilities = {
                          - add  = []
                            # (1 unchanged attribute hidden)
                        }
                    }
                  - mountPoints            = []
                    name                   = "celery-worker"
                  - systemControls         = []
                  - volumesFrom            = []
                    # (7 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "celery-worker" -> (known after apply)
      ~ revision                 = 13 -> (known after apply)
        tags                     = {
            "CostCentre" = "cds-superset-prod"
            "Terraform"  = "true"
        }
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.superset_ecs.aws_ecs_service.this will be updated in-place
  ~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:ca-central-1:066023111852:service/superset/superset"
        name                               = "superset"
        tags                               = {
            "CostCentre" = "cds-superset-prod"
            "Terraform"  = "true"
        }
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:066023111852:task-definition/superset:29" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.superset_ecs.aws_ecs_task_definition.this must be replaced
-/+ resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:066023111852:task-definition/superset:29" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ca-central-1:066023111852:task-definition/superset" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  - cpu                    = 0
                  - essential              = true
                  ~ linuxParameters        = {
                      ~ capabilities = {
                          - add  = []
                            # (1 unchanged attribute hidden)
                        }
                    }
                  - mountPoints            = []
                    name                   = "superset"
                  - systemControls         = []
                  - volumesFrom            = []
                    # (7 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "superset" -> (known after apply)
      ~ revision                 = 29 -> (known after apply)
        tags                     = {
            "CostCentre" = "cds-superset-prod"
            "Terraform"  = "true"
        }
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 4 to add, 8 to change, 4 to destroy.

Warning: Argument is deprecated

  with module.notify_data_export.aws_s3_bucket.this,
  on .terraform/modules/notify_data_export/S3/main.tf line 8, in resource "aws_s3_bucket" "this":
   8: resource "aws_s3_bucket" "this" {

Use the aws_s3_bucket_server_side_encryption_configuration resource instead

(and 2 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.cur_data_extract"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.notify"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.data_export"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.glue_etl"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.glue_s3_crawler"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.superset_athena_read"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.data_export"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.glue_crawler"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.glue_etl"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.superset_athena_read"]
WARN - plan.json - main - Missing Common Tags: ["aws_kms_key.data_export"]
WARN - plan.json - main - Missing Common Tags: ["module.superset-redis.aws_elasticache_subnet_group.default"]

31 tests, 19 passed, 12 warnings, 0 failures, 0 exceptions

```

</details>
